{"w55xmZLWfBg": [["Why would you call them litter mates? It's their siblings, all of them, whether they're close or not, they're all blood related. Therefore, they're siblings.", "2023-03-04T05:57:54Z"], ["Thank you so much really god bless you ❤️❤️❤️", "2023-03-02T11:33:47Z"], ["Bless ❤️", "2023-03-01T20:35:35Z"], ["That’s absolutely awesome. I smiled all of the way through.", "2023-03-01T14:33:12Z"], ["ALL extremely AWESOME people, keeping a fur family in touch with each other. Warms my heart 💜", "2023-03-01T13:30:20Z"], ["Kudos to Ernie's & Taco's pawrents for going that extra step for their respective pups. Hopefully, they'll be able to keep the relationship going in the years to come. Wishing them all much health and happiness in the years ahead.", "2023-03-01T01:04:53Z"], ["Taco 🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶", "2023-02-28T15:01:39Z"], ["Cute puppys 🦆", "2023-02-28T13:12:58Z"], ["🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰", "2023-02-27T22:18:26Z"], ["🤝🏾🇺🇲💪🏾❤️❤️❤️❤️❤️😊", "2023-02-27T19:50:34Z"], ["I LOVE the community-building nature of dogs, dogs, and more dogs!  They bring people together.  🐕‍🦺, 🦮, and more 🐕's!", "2023-02-26T22:00:41Z"], ["Brilliant play date. Such a lovely thing to do.", "2023-02-26T21:50:23Z"], ["Those dogs were right to have those playdates! 😄", "2023-02-26T16:34:32Z"], ["💞🐾🐾🐾🐾💖", "2023-02-26T13:33:14Z"], ["Your compassion and thoughtfulness has made these pets so happy! The world is a better place because of you.", "2023-02-26T13:30:16Z"], ["*I am glad, relieved lol, that when they talked about the dog's sister they actually meant a Dog and not some person which they often do in the Disturbed ''Dodo world'' lol and in some delusional people's heads! Nice! They actually used the Right words for the right situation, dog has a sister and that sister is obviously another animal, a dog. Other times they are insane and use it so losely like in reference to the people around them!*", "2023-02-26T12:08:31Z"], ["Wow mix litter one black other Chocolate 🍫", "2023-02-26T11:22:47Z"], ["可愛い ワンワン たち😍🐾😍🐾", "2023-02-26T05:09:29Z"], ["Just adorable 🦴🐶🐾🥰🤗", "2023-02-26T05:08:34Z"], ["🥀🌹🌹⚘️🌲🌲🌷🦚🦚🌷🌲⚘️🌹🥀🌷🌷🌲🌲⚘️🌹\n\n🌹🌹   THANK.  YOU. !!!!\n\n🌹🌹   \"  TAKIS\n\n🌹🌹   SHELTER. \"\n\n🌹🌹   U.  TUBE\n\n🌹🌹   \" GRATITUDE. \"\n\n🌹⚘️🌲🌲🌷🌷🥀🥀🦚🦚🌺🥀🌷🌲⚘️🌹🌹⚘️🌲🌷🌷🥀🥀🌷🌲🌹", "2023-02-25T17:48:57Z"]], "NsscBcwjTNg": [["all these stories remind one of how important to spay and neuter pets - so the cycle of abandonment, abuse and neglect is not perpetuated.   thanks to all humane rescuers.", "2023-03-06T17:25:07Z"], ["Gods angels in action. Thank you for all you do.", "2023-03-06T05:15:06Z"], ["That poor soul. Was there mold on his fur? In honestly believe people who save animals are some of the angels on earth in physical form. Thanknyou for your selflessness", "2023-03-06T04:41:59Z"], ["he's cute guy with beautiful heart", "2023-03-06T00:27:46Z"], ["Thank you for saving Balinese dogs.!", "2023-03-05T16:40:54Z"], ["Bravo for him to recuse these dogs! They deserved to lead a good life!!", "2023-03-02T18:22:39Z"], ["😇😇😇😇💕💕💕💕🙏🙏", "2023-03-02T07:24:07Z"], ["SUPER Angel ! love him💕💕💕", "2023-03-02T03:58:51Z"], ["Thank you for being a Earth Angel ) !!!! ❤️💯⭐", "2023-03-02T01:08:30Z"], ["Bugos❤❤❤❤.", "2023-03-02T01:03:57Z"], ["Thank you.God bless .🙏🙏", "2023-03-02T00:26:35Z"], ["You have a heart made in heaven.", "2023-03-02T00:07:16Z"], ["What an amazing, wonderful guy. What a difference he has made to these dogs lives. It's beautiful 🙏🙌❤️", "2023-03-01T19:52:52Z"], ["Thank you so much for what you do.", "2023-03-01T17:09:00Z"], ["You’re a great human. I love you 🥰", "2023-03-01T12:36:51Z"], ["What an amazing young man! God bless you! ❤ Thank you for saving those precious pups ❤", "2023-03-01T10:25:29Z"], ["Thank you so much for your love devotion, dedication be sacrifice! God Bless your heart in saving these precious baby ! The world needs many  more like you ♥️🙏🏾", "2023-03-01T01:34:55Z"], ["LOVE in action.  These precious dogs are reflecting the love you showed them! God bless you for the wonderful work you are doing.", "2023-03-01T00:32:14Z"], ["I love stories that have happy endings for animals! Thank you!🥹😍🐶🐾❤️‍🔥💋♾️🙏🏽", "2023-03-01T00:18:51Z"], ["You sir are Awesome! Keep up the good work. May it come back to you tenfold", "2023-02-28T23:45:54Z"]], "DEtyL4lXp7s": [["Every greyhound I've ever met was so sweet and kind...", "2023-03-06T22:49:44Z"], ["being a goddamned fashion icon helps, i'm sure", "2023-03-06T22:32:26Z"], ["😍", "2023-03-06T21:22:50Z"], ["you guys are giving him such a great life", "2023-03-06T21:14:57Z"], ["It's beautiful what you've done with this Greyhound.  They're such gorgeous animals.  \n\nI still prefer cats, though, but that doesn't mean I don't appreciate dogs.", "2023-03-06T14:32:44Z"], ["To think all he knew was racing barriers and racing barriers. Such a change.", "2023-03-06T08:34:35Z"], ["Oh, my goodness.What a sweetheart. His howl was hilarious.\n~~~~\nAnd...related only by a thread, but something which always comes to my mind when I read of animals being forced to work: I really wish that people would stop riding camels when they visit countries that offer them.\nThere must be very few that train them up with care and safety, and which also defer to the well-being of the animal instead of prioritizing forced/violent compliance and squeezing in as many rides as possible. It's always bothered me. I don't understand how people are still doing this.", "2023-03-06T02:11:31Z"], ["The world needs more people like you 🐾❤️", "2023-03-06T00:50:04Z"], ["Paul: \"I'm NOT going out dressed like this\"", "2023-03-06T00:11:16Z"], ["Paul is a nudist. He does not like the hat, the shoes, the shitty capes. Paul is like me.", "2023-03-05T21:57:50Z"], ["Paul! 😂😂😂 ❤❤❤", "2023-03-05T21:24:38Z"], ["you have too much clothing on him--especially in the house...it hinders his movement and freedom", "2023-03-04T21:29:57Z"], ["It's great to see them when they finally break out into \"The Zoomies\"! ❤", "2023-03-04T08:30:50Z"], ["He is so cute.  I wonder if he will do the adorable greyhound teeth chatter?", "2023-03-04T02:22:53Z"], ["I love that the most replayed moment is 3:21", "2023-03-03T23:16:52Z"], ["Why are you putting stupid fxxking clothes on him", "2023-03-03T19:37:56Z"], ["This racing dog could not have been \"civilianized\" by a more lucid, fun family. 👌👍🤙", "2023-03-03T18:30:28Z"], ["I bet he loved the mountains", "2023-03-03T16:36:16Z"], ["Lord he looks so cute in his hat", "2023-03-03T16:32:59Z"], ["I like how they had Paul dressed like one of the homeless guys in the John Wick movies!", "2023-03-03T14:51:23Z"]], "ECHlvUyaXFU": [["Rhya belongs because you care to be her long lost forever mom!  She knows heart is set and her taste buds are the luckiest!!  Thank you for giving her the greatest home and heart!", "2023-03-07T00:57:25Z"], ["What a marvelous family ! God bless u all.", "2023-03-05T22:15:16Z"], ["It's time to celebrate! Give him a shot and a beer, he'll love it!!", "2023-03-05T14:28:31Z"], ["the women should start a bakery if not already!", "2023-03-05T12:26:47Z"], ["Hoping that someday I can help many streetdogs here in my country Philippines.. All I need for now are people who interesting watch my content about dogs, So if I can do that many viewer can I invite, so it's not hard for me to help other dogs in my town, having a family for dogs very important for them like us people we need love and their also need our love..", "2023-03-05T12:02:15Z"], ["Thank you for sharing and thank you for loving Rya.", "2023-03-05T08:53:36Z"], ["Beautifuldogsthankyouforsavingherandthankyouforadoptedingherilovethevideoiwillfollowyou", "2023-03-05T00:41:32Z"], ["Another over bred dog owned by people that want dog to bite. All our rescue money squandered on Pitbull bred . There has to be a law, they fill our shelters and other dog put down because of idiots like dodo sensationalize them 400 years of bull it the pit biting. The breed  is terrible.", "2023-03-04T15:20:32Z"], ["OPEN UP BAKERY FOR ANIMALS..", "2023-03-04T12:26:08Z"], ["Beautiful", "2023-03-04T09:56:17Z"], ["People like this woman are absolutely my heroes ❤love her and her fur babies ❤❤❤❤❤", "2023-03-04T09:06:50Z"], ["Kindness is a weakness to the indecent but virtuous to the decent. Thank you for being among our most decent. Bravo well done.", "2023-03-04T02:30:33Z"], ["God Bless You 🙏🙏🙏🙏💖 Such Sweet Babies 💖🙏💖", "2023-03-03T22:54:41Z"], ["I would buy this book her cookbook for dogs", "2023-03-03T03:29:53Z"], ["🙂👋", "2023-03-03T01:05:45Z"], ["The doggy desserts look pawbulous! And what an ingenious way to bring everyone together.", "2023-03-02T05:35:55Z"], ["She’s beautiful! Thanks for making her whole again😊", "2023-03-02T04:45:03Z"], ["Yummy", "2023-03-02T03:43:30Z"], ["God bless you and your family for taking this incredible rescue dog. She is living an amazing life, thanks to your compassion and kindness! Rhya is so beautiful!!!!!", "2023-03-01T18:10:09Z"], ["Your dogs are so gorgeous!!!! And your baking is so excellent!!!!", "2023-03-01T08:51:33Z"]], "4znhKBm5oOA": [["Such a beautiful doggo, and such great people!", "2023-03-06T11:57:55Z"], ["I hate onions", "2023-03-05T20:28:51Z"], ["Thank you for helping this beautiful animal!! I hope you live a long and happy life, full of more rescues!! Bless your kind heart!!!👍🏻😀", "2023-03-05T16:45:17Z"], ["You should have taken the puppy yourself", "2023-03-05T12:56:00Z"], ["Bless you all.", "2023-03-04T14:13:33Z"], ["didn't even make it out of the vet without someone wanting him, haha.", "2023-03-04T12:06:04Z"], ["Nice work. We are proud to have you among our most decent humans. Tony hit the jackpot and will have beautiful moments from now on. Bravo thank you.", "2023-03-04T03:13:37Z"], ["🙂", "2023-03-03T07:09:11Z"], ["What an absolute goob.", "2023-03-03T05:38:42Z"], ["I miss my two shadows.", "2023-03-02T12:54:58Z"], ["I don't think that pup should be running around like that with a cast on...the bone could break again.", "2023-03-02T11:33:49Z"], ["Love Tony!", "2023-03-01T17:54:30Z"], ["What a beautiful  sweet happy dog.  Watching him run free is a true miracle and delight.  So so happy for him.", "2023-03-01T13:57:30Z"], ["So happy you all found one another. Love you Tony.🙏🐾", "2023-03-01T13:29:54Z"], ["I think it’s wonderful that there are people who can foster animals. It would be impossible for me to do it, I’d get too attached, especially to such an adorable dog!", "2023-03-01T02:30:09Z"], ["Tony 💪🐕💪🐕💪🐕💪🐕💪🐕💪🐕💪🐕💪🐕", "2023-02-28T14:33:52Z"], ["🦮🐶🐕‍🦺🐈🐈🐕🐕🐈‍⬛🐈‍⬛🐈‍⬛🐕🐕🐈🐶🦮🦮🐶🐕‍🦺🐕🐈‍⬛🐈‍⬛🐕‍🦺🐶🦮🐕‍🦺🐈  \n\n🐈🐶  WE.  LOVE\n\n🐶🐈   YOU !!!!\n\n🐈🐶   \"  TAKIS\n\n🐶🐈    SHELTER. \"\n\n🐈🐶    U.   TUBE\n\n🐶🐈    \" BLESSINGS !!!!  \"\n\n\n🐈🐶🐕‍🦺🐕‍🦺🦮🦮🐈‍⬛🐈‍⬛🐕🐕🐈‍⬛🦮🦮🐕‍🦺🐶🐈🐶🐕‍🦺🐈‍⬛🐕🐕🐕‍🦺🐕‍🦺🐶🐶🐕‍🦺", "2023-02-28T02:22:27Z"], ["When something is right ✅️  you know it's right ✅️", "2023-02-28T02:20:05Z"], ["Thank you! I love watching zoomies!", "2023-02-27T23:43:32Z"], ["I would always be a foster fail..and that’s the problem 😅😔🤣", "2023-02-27T19:01:20Z"]]}