{"w55xmZLWfBg": [["Thank you so much really god bless you ❤️❤️❤️", "2023-03-02T11:33:47Z"], ["Bless ❤️", "2023-03-01T20:35:35Z"], ["That’s absolutely awesome. I smiled all of the way through.", "2023-03-01T14:33:12Z"], ["ALL extremely AWESOME people, keeping a fur family in touch with each other. Warms my heart 💜", "2023-03-01T13:30:20Z"], ["Kudos to Ernie's & Taco's pawrents for going that extra step for their respective pups. Hopefully, they'll be able to keep the relationship going in the years to come. Wishing them all much health and happiness in the years ahead.", "2023-03-01T01:04:53Z"], ["Taco 🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶🤗🐶", "2023-02-28T15:01:39Z"], ["Cute puppys 🦆", "2023-02-28T13:12:58Z"], ["🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰", "2023-02-27T22:18:26Z"], ["🤝🏾🇺🇲💪🏾❤️❤️❤️❤️❤️😊", "2023-02-27T19:50:34Z"], ["I LOVE the community-building nature of dogs, dogs, and more dogs!  They bring people together.  🐕‍🦺, 🦮, and more 🐕's!", "2023-02-26T22:00:41Z"], ["Brilliant play date. Such a lovely thing to do.", "2023-02-26T21:50:23Z"], ["Those dogs were right to have those playdates! 😄", "2023-02-26T16:34:32Z"], ["💞🐾🐾🐾🐾💖", "2023-02-26T13:33:14Z"], ["Your compassion and thoughtfulness has made these pets so happy! The world is a better place because of you.", "2023-02-26T13:30:16Z"], ["*I am glad, relieved lol, that when they talked about the dog's sister they actually meant a Dog and not some person which they often do in the Disturbed ''Dodo world'' lol and in some delusional people's heads! Nice! They actually used the Right words for the right situation, dog has a sister and that sister is obviously another animal, a dog. Other times they are insane and use it so losely like in reference to the people around them!*", "2023-02-26T12:08:31Z"], ["Wow mix litter one black other Chocolate 🍫", "2023-02-26T11:22:47Z"], ["可愛い ワンワン たち😍🐾😍🐾", "2023-02-26T05:09:29Z"], ["Just adorable 🦴🐶🐾🥰🤗", "2023-02-26T05:08:34Z"], ["🥀🌹🌹⚘️🌲🌲🌷🦚🦚🌷🌲⚘️🌹🥀🌷🌷🌲🌲⚘️🌹\n\n🌹🌹   THANK.  YOU. !!!!\n\n🌹🌹   \"  TAKIS\n\n🌹🌹   SHELTER. \"\n\n🌹🌹   U.  TUBE\n\n🌹🌹   \" GRATITUDE. \"\n\n🌹⚘️🌲🌲🌷🌷🥀🥀🦚🦚🌺🥀🌷🌲⚘️🌹🌹⚘️🌲🌷🌷🥀🥀🌷🌲🌹", "2023-02-25T17:48:57Z"], ["SAY GOD IS ONLY ONE💚 HE IS SELF SUFFICIENT 💚 HE BEGOT NOT NOR HE BEGOTTEN 💚 THERE IS NOTHIN LIKE TO HIM 💚 QURAN 112 💚💜❤️", "2023-02-25T15:17:26Z"]], "NsscBcwjTNg": [["😇😇😇😇💕💕💕💕🙏🙏", "2023-03-02T07:24:07Z"], ["SUPER Angel ! love him💕💕💕", "2023-03-02T03:58:51Z"], ["Thank you for being a Earth Angel ) !!!! ❤️💯⭐", "2023-03-02T01:08:30Z"], ["Bugos❤❤❤❤.", "2023-03-02T01:03:57Z"], ["Thank you.God bless .🙏🙏", "2023-03-02T00:26:35Z"], ["You have a heart made in heaven.", "2023-03-02T00:07:16Z"], ["What an amazing, wonderful guy. What a difference he has made to these dogs lives. It's beautiful 🙏🙌❤️", "2023-03-01T19:52:52Z"], ["Thank you so much for what you do.", "2023-03-01T17:09:00Z"], ["You’re a great human. I love you 🥰", "2023-03-01T12:36:51Z"], ["What an amazing young man! God bless you! ❤ Thank you for saving those precious pups ❤", "2023-03-01T10:25:29Z"], ["Thank you so much for your love devotion, dedication be sacrifice! God Bless your heart in saving these precious baby ! The world needs many  more like you ♥️🙏🏾", "2023-03-01T01:34:55Z"], ["LOVE in action.  These precious dogs are reflecting the love you showed them! God bless you for the wonderful work you are doing.", "2023-03-01T00:32:14Z"], ["I love stories that have happy endings for animals! Thank you!🥹😍🐶🐾❤️‍🔥💋♾️🙏🏽", "2023-03-01T00:18:51Z"], ["You sir are Awesome! Keep up the good work. May it come back to you tenfold", "2023-02-28T23:45:54Z"], ["God bless you 💗💞💗💞💗", "2023-02-28T19:47:30Z"], ["🥳🎉🥳🎉🥳🎉🥳🎉🥳🎉🥳🎉🥳🎉🥳🎉🥳🎉", "2023-02-28T14:46:47Z"], ["Hey angel children of God we’re did you are are you in USA 🇺🇸??? God bless youuuuuu love uuuuuuu omg you are amazing 🙏🏼🙏🏼🙏🏼🙏🏼♥️♥️♥️♥️🥰🥰🥰🥰🥰👍👍👍👍👍👍😇😇😇😇🤣", "2023-02-28T08:53:32Z"], ["Bless ❤️", "2023-02-27T19:53:02Z"], ["heartwarming", "2023-02-27T13:18:19Z"], ["Thank you!!", "2023-02-27T12:23:02Z"]], "DEtyL4lXp7s": [["definition of groomed to only run", "2023-03-02T18:16:14Z"], ["One look at him tells me why the outlawed greyhound racing. Clearly it was for the best", "2023-03-02T07:55:55Z"], ["Thank you so much for rescuing Paul ❤💙 It's so nice seeing his joy, appreciating things. I'm glad he's with people he deserves", "2023-03-02T02:43:13Z"], ["🥺🙂😊❤️❤️", "2023-03-01T22:25:54Z"], ["Of course he's having a hard time being a dog.... His name is Paul and he wears clothes, he probably thinks he's a human and is thoroughly confused about why you want him to play w/ dogs.\n🤣🤣", "2023-03-01T17:21:43Z"], ["He is beautiful...thank you for your patience with Paul..so glad he is happy...🤗👍🌞", "2023-03-01T16:05:36Z"], ["Paul just had to find his way. He looks so happy.Awoooooo Paul.🙏🐾🦴", "2023-03-01T13:34:07Z"], ["This is what my heart needed this morning.", "2023-03-01T12:31:17Z"], ["You guys are wonderful and inspiring!", "2023-03-01T10:29:13Z"], ["God bless you guys you're amazing.💞  When I have enough money I'll do the same.", "2023-03-01T08:57:35Z"], ["I think he's not nervous but embarassed wearing that outfit around those other dogs 😁", "2023-03-01T08:45:51Z"], ["I live close to a dog race track here in FL, only a couple miles away. We were all so happy when they stopped the racing and these dogs got to experience a decent life. Im so happy to be able to see these stories. I wonder if he came from the track near my home 🏡  ♥️", "2023-03-01T07:08:10Z"], ["Thank you So much Elizabeth and Holden 🙏🏾God Bless you both Paul is gorgeous ! Appreciate you both for saving this highly abused breed Love you all ❤🙏🏾", "2023-03-01T00:23:20Z"], ["BEAUTIFUL!!!!!!!", "2023-02-28T22:07:38Z"], ["fantastic", "2023-02-28T21:28:51Z"], ["Lucky Paul to have found the kind loving family he deserves!", "2023-02-28T17:07:36Z"], ["💚💚💚💚💚💚💚💚", "2023-02-28T16:35:19Z"], ["I love the Dodo 💙💛", "2023-02-28T16:34:29Z"], ["YAY PAUL!!! 🥳🎉🥳🎉🥳🎉🥳🎉🥳🎉🥳🎉🥳", "2023-02-28T14:13:59Z"], ["😍Paul is a cutie pie!!", "2023-02-28T14:12:07Z"]], "ECHlvUyaXFU": [["The doggy desserts look pawbulous! And what an ingenious way to bring everyone together.", "2023-03-02T05:35:55Z"], ["She’s beautiful! Thanks for making her whole again😊", "2023-03-02T04:45:03Z"], ["Yummy", "2023-03-02T03:43:30Z"], ["God bless you and your family for taking this incredible rescue dog. She is living an amazing life, thanks to your compassion and kindness! Rhya is so beautiful!!!!!", "2023-03-01T18:10:09Z"], ["Your dogs are so gorgeous!!!! And your baking is so excellent!!!!", "2023-03-01T08:51:33Z"], ["Bless you for your kindness .", "2023-03-01T00:51:38Z"], ["what a Crew!  They must LOVE their Mama for those fantastic treats!", "2023-02-28T20:29:06Z"], ["Adorable 🥰🐶", "2023-02-28T19:42:55Z"], ["You have compassion, and a joyful way of showing love and helping others. Amazing story. So glad everyone is happy and healthy..cheers.. I'd like a cake 🎂 too if your baking....just sayin.💛💛💛💛💛💛💛🏆", "2023-02-28T17:57:51Z"], ["More extravagant lol. That made me smile.", "2023-02-28T16:37:06Z"], ["RHYA 🤗🐕♥️🤗🐕♥️🤗🐕♥️🤗🐕♥️🤗🐕♥️🤗", "2023-02-28T14:23:42Z"], ["Oh my goodness, can you adopt me…those desserts are amazing!! Thank you so much for giving her a chance at love ❤️", "2023-02-28T13:20:22Z"], ["People who save animals are the best people ❤️🔥💪🏻🥓", "2023-02-28T10:34:03Z"], ["Wow! What amazing dog cakes and what lucky dogs! Beautiful!", "2023-02-28T03:11:53Z"], ["Those treats look good enough to eat does she have a web page with the recipes? I would love to try them on my dog", "2023-02-27T20:06:46Z"], ["Spoon feeding the dogs such a delicious treat looked like such a fun thing to do with your dogs! Such sweet memories!", "2023-02-27T16:53:25Z"], ["This is a great idea!! I ❤️ watching my 🐶reaction while I'm preparing his supper every night. The best thing I've ever done in my life is adopt my Chigi the 2nd best thing is to start a channel with him it's a bonding experience & a big learning curve for me!💯😍🐕🤗❤️🐶!!", "2023-02-27T13:07:16Z"], ["did i see that....she was feedimng the dog  off the spoon she was making   batter of....now thats   gross  /nutzo..not  sano.....nooo  bueno", "2023-02-27T12:41:01Z"], ["After ALL your ❤- WORK Baking Exquisitely Elaborate CAKES for your 4 FUR-BABIES, I am So Happy that NOTHING GOES TO WASTE!!!!\n🤣🤣🤣", "2023-02-27T04:01:16Z"], ["What a great life ❤", "2023-02-27T02:26:57Z"]], "4znhKBm5oOA": [["I miss my two shadows.", "2023-03-02T12:54:58Z"], ["I don't think that pup should be running around like that with a cast on...the bone could break again.", "2023-03-02T11:33:49Z"], ["Love Tony!", "2023-03-01T17:54:30Z"], ["What a beautiful  sweet happy dog.  Watching him run free is a true miracle and delight.  So so happy for him.", "2023-03-01T13:57:30Z"], ["So happy you all found one another. Love you Tony.🙏🐾", "2023-03-01T13:29:54Z"], ["I think it’s wonderful that there are people who can foster animals. It would be impossible for me to do it, I’d get too attached, especially to such an adorable dog!", "2023-03-01T02:30:09Z"], ["Tony 💪🐕💪🐕💪🐕💪🐕💪🐕💪🐕💪🐕💪🐕", "2023-02-28T14:33:52Z"], ["🦮🐶🐕‍🦺🐈🐈🐕🐕🐈‍⬛🐈‍⬛🐈‍⬛🐕🐕🐈🐶🦮🦮🐶🐕‍🦺🐕🐈‍⬛🐈‍⬛🐕‍🦺🐶🦮🐕‍🦺🐈  \n\n🐈🐶  WE.  LOVE\n\n🐶🐈   YOU !!!!\n\n🐈🐶   \"  TAKIS\n\n🐶🐈    SHELTER. \"\n\n🐈🐶    U.   TUBE\n\n🐶🐈    \" BLESSINGS !!!!  \"\n\n\n🐈🐶🐕‍🦺🐕‍🦺🦮🦮🐈‍⬛🐈‍⬛🐕🐕🐈‍⬛🦮🦮🐕‍🦺🐶🐈🐶🐕‍🦺🐈‍⬛🐕🐕🐕‍🦺🐕‍🦺🐶🐶🐕‍🦺", "2023-02-28T02:22:27Z"], ["When something is right ✅️  you know it's right ✅️", "2023-02-28T02:20:05Z"], ["Thank you! I love watching zoomies!", "2023-02-27T23:43:32Z"], ["I would always be a foster fail..and that’s the problem 😅😔🤣", "2023-02-27T19:01:20Z"], ["Thank you for just being human.\nI'm not a dog guy. Pretty much the opposite to be honest.\nBut as an animal lover, thank you for providing those guys a safe place :)", "2023-02-27T18:57:14Z"], ["When I saw this little man I was like \"yep he would be a foster fail!\" and then he did become a foster fail! lol Fricking perfect!", "2023-02-27T16:21:43Z"], ["66", "2023-02-26T21:36:54Z"], ["What I kind and loving family to be given that loving sweet dog. They were meant to be !", "2023-02-26T20:39:57Z"], ["At the beginning of this video the place where Tony was kept with his bad leg, did they just leave him in pain suffering, until what?? The poor boy! Luckily these angels came along and helped Tony! He's a beautiful, gentle little soul! What a treasure he is!! 🐕 💕", "2023-02-26T20:35:37Z"], ["Love it! ❤️ Yay Tony & your new forever family", "2023-02-26T18:05:10Z"], ["Tony looks like an awesome pup and these are awesome people for taking him in! If only every animal that needed a good home could find one.", "2023-02-26T17:22:49Z"], ["Tony is gorgeous. Awesome rescuers also!", "2023-02-26T14:35:02Z"], ["i knew it the second she said she wanted to foster him. she was going to fail. but the way i see it is if your going to fail at something it should be fostering. Great video", "2023-02-26T07:02:12Z"]]}