{"w55xmZLWfBg": [["I LOVE the community-building nature of dogs, dogs, and more dogs!  They bring people together.  🐕‍🦺, 🦮, and more 🐕's!", "2023-02-26T22:00:41Z"], ["Brilliant play date. Such a lovely thing to do.", "2023-02-26T21:50:23Z"], ["Those dogs were right to have those playdates! 😄", "2023-02-26T16:34:32Z"], ["💞🐾🐾🐾🐾💖", "2023-02-26T13:33:14Z"], ["Your compassion and thoughtfulness has made these pets so happy! The world is a better place because of you.", "2023-02-26T13:30:16Z"], ["*I am glad, relieved lol, that when they talked about the dog's sister they actually meant a Dog and not some person which they often do in the Disturbed ''Dodo world'' lol and in some delusional people's heads! Nice! They actually used the Right words for the right situation, dog has a sister and that sister is obviously another animal, a dog. Other times they are insane and use it so losely like in reference to the people around them!*", "2023-02-26T12:08:31Z"], ["Wow mix litter one black other Chocolate 🍫", "2023-02-26T11:22:47Z"], ["可愛い ワンワン たち😍🐾😍🐾", "2023-02-26T05:09:29Z"], ["Just adorable 🦴🐶🐾🥰🤗", "2023-02-26T05:08:34Z"], ["🥀🌹🌹⚘️🌲🌲🌷🦚🦚🌷🌲⚘️🌹🥀🌷🌷🌲🌲⚘️🌹\n\n🌹🌹   THANK.  YOU. !!!!\n\n🌹🌹   \"  TAKIS\n\n🌹🌹   SHELTER. \"\n\n🌹🌹   U.  TUBE\n\n🌹🌹   \" GRATITUDE. \"\n\n🌹⚘️🌲🌲🌷🌷🥀🥀🦚🦚🌺🥀🌷🌲⚘️🌹🌹⚘️🌲🌷🌷🥀🥀🌷🌲🌹", "2023-02-25T17:48:57Z"], ["SAY GOD IS ONLY ONE💚 HE IS SELF SUFFICIENT 💚 HE BEGOT NOT NOR HE BEGOTTEN 💚 THERE IS NOTHIN LIKE TO HIM 💚 QURAN 112 💚💜❤️", "2023-02-25T15:17:26Z"], ["Such a beautiful video, I couldn't stop giggling and watching how wonderfully they played together. Love it💜", "2023-02-25T14:29:42Z"], ["So cute! Glad they get to spend time together!!", "2023-02-25T13:16:31Z"], ["❤❤🐕🐕🐕🐕🐾🐾❤❤🍀🍀🌞🌞😊😊", "2023-02-25T12:12:25Z"], ["😃👍", "2023-02-25T11:02:47Z"], ["Perfect scenario, be next door neighbors??? Just a thought....", "2023-02-25T09:42:53Z"], ["몇시와?오늘?", "2023-02-25T07:39:34Z"], ["They are too adorable.", "2023-02-25T06:53:39Z"], ["Most litter mates never see each other again, but these wonderful people getting the two and then the family together... Well, it's just fantastic! There's no reasons siblings shouldn't have fun together throughout their lives!", "2023-02-25T06:21:01Z"], ["Thank you Dodo, God bless you all.", "2023-02-25T06:12:08Z"]], "NsscBcwjTNg": [["Send him money and help, as it's so heart lifting to see in this disappearing world.", "2023-02-26T20:28:56Z"], ["He is a HERO to them God for Bless  you", "2023-02-26T19:12:18Z"], ["thank you for your strong heart and courageous spirit to find and help these precious pups!", "2023-02-26T18:39:08Z"], ["Thank You for rescuing these animals they are adorable", "2023-02-26T17:02:56Z"], ["Thank you for all you do 💚", "2023-02-26T12:06:17Z"], ["The only good channel on the internet", "2023-02-26T11:09:57Z"], ["I am so glad there are people out there like you.  It pushes the disappointment in the human race away for a while.  So thank you!❤❤❤", "2023-02-26T05:43:51Z"], ["You are a God sent!!  Thank you for all you do", "2023-02-26T01:43:07Z"], ["i wish they all could be saved.", "2023-02-25T23:24:43Z"], ["Who needs He-Man when you can watch a REAL Aaron on Youtube ??? He has the POWER OF LOVE ❣", "2023-02-25T22:03:41Z"], ["Poor digby, he was whimpering in the cage", "2023-02-25T19:59:19Z"], ["good job, but PLEASE dont poke them through the cage bars, they are scared enough already .", "2023-02-25T11:40:25Z"], ["Thankyou for your Love and Compassionate Action   \nIn Loving these dogs.  This Love uplifts All Life💜💜🌈🎁", "2023-02-25T06:18:25Z"], ["Bless you kindhearted soul THANK YOU FOR WHAT YOU ARE DOING 🥰 You Are A GREAT SOUL .......☮️❤️🕯️", "2023-02-25T06:16:00Z"], ["❤", "2023-02-25T05:41:50Z"], ["God bless you Aron. God bless your beautiful, compassionate, selfless heart.💕🙏💕", "2023-02-25T01:23:42Z"], ["Aron is an angel of a man. \nAlso 1:24 - what kind of half assed attempt is that at blurring out  the child's face?", "2023-02-24T22:17:42Z"], ["Cute family friend 😁", "2023-02-24T22:13:04Z"], ["😭💖", "2023-02-24T22:05:57Z"]], "DEtyL4lXp7s": [["What a sweetie!❤", "2023-02-26T19:34:38Z"], ["The owner deserves a hat off.", "2023-02-26T19:21:43Z"], ["Thanks to all rescuers!", "2023-02-26T19:08:00Z"], ["This story was our story. Our Sterling is now long gone, but lived to the happy age of 13. Thanks for sparking my memories and a few tears.", "2023-02-26T18:58:59Z"], ["Such a beautiful and happy pup 👍🐕", "2023-02-26T17:43:46Z"], ["*THERE MUST BE A SPECIAL PLACE IN HEAVEN FOR THOSE WHO HELP ANIMALS IN NEED.     GOD BLESS YOU !!!*", "2023-02-26T16:59:16Z"], ["He wasn’t saved from anything. He raced and was treated like a professional athlete. Keep in mind he never saw stairs up until this point. He knew the track and his turnout and his race mates. \nI’m on my ninth hound , and have fostered over 40 right off the track. They are great pets. That are now few and far between due to track closures.", "2023-02-26T16:17:08Z"], ["The sweetest boy! Thank you for giving him a wonderful life!❤", "2023-02-26T13:05:29Z"], ["Galgos.💙♥️🤗", "2023-02-26T12:32:35Z"], ["Hey wanna be really sad and then really happy? Watch The Dodo.", "2023-02-26T12:00:52Z"], ["Just me sitting here eating my breakfast, totally not happy crying for Paul. 🥺🥰", "2023-02-26T11:38:16Z"], ["Now, living his best life Xx", "2023-02-26T11:24:26Z"], ["THANK YOU SOO MUCH FOR RESCUING PAUL & SHOW HIM SO MUCH LOVE & HOW A DOG SHOULD REALLY BE FREE & HAPPY! PAUL IS A VERY LUCKY DOG YOU FOUND HIM! ENJOY YOUR FREEDOM PAUL!! THANKS AGAIN FOR SAVING HIM! YOU ARE HEROES IN MY BOOK! 💯☝️🐾🐶❤️💞😍😘💕👍", "2023-02-26T10:33:23Z"], ["Heart warming ❤", "2023-02-26T10:31:03Z"], ["What a lovely video!", "2023-02-26T09:16:26Z"], ["Sleeping Paul is adorable.  I would love to sleep so soundly.  Thank you for making his life so special for him.", "2023-02-26T08:26:41Z"], ["I want to see more Greyhound \nStories. They are my favorite breed.", "2023-02-26T05:50:57Z"], ["Thank you for being a good soul", "2023-02-26T05:25:27Z"], ["It's amazing how animals can recover from a lifetime of brutality from \"humanity\".", "2023-02-26T04:53:53Z"], ["So handsome", "2023-02-26T04:28:21Z"]], "ECHlvUyaXFU": [["Bless ❤️", "2023-02-26T20:28:26Z"], ["Aww I’m so happy that you adopted her  I’m very happy that she has a new loving family and forever home ❤️❤️❤️❤️❤️", "2023-02-26T17:57:31Z"], ["I believe this womans Love got Ryha better. Love can do amazing things, even cure.", "2023-02-26T16:59:01Z"], ["Questionable diet", "2023-02-26T04:23:06Z"], ["Those cakes are works of art that belong in a culinary museum!  What lucky dogs to have a mama that goes out of her way to make their lives beautiful and tasty!", "2023-02-26T04:05:44Z"], ["thanks", "2023-02-26T03:45:05Z"], ["lady, you need children. pets are not replacements and should not be treated as such", "2023-02-26T00:32:50Z"], ["Sweet pups!  Lucky also to have wonderful parents!", "2023-02-25T23:41:56Z"], [":)", "2023-02-25T22:55:25Z"], ["You are very kind sole. The world needs more people like you.", "2023-02-25T21:19:25Z"], ["I bet it would be ok for humans to eat too!", "2023-02-25T19:49:40Z"], ["Lol so adorable all of them waiting so patetiently for cake yummy 😋 😊 ☺ 😜.", "2023-02-25T17:13:18Z"], ["Rhya is adopted and it's a special day to celebrate with a cake 🎂! Happy Adoptversary Rhya! Your family and siblings are all so happy 😁 for you! I am too!!", "2023-02-25T15:35:11Z"], ["정말 사랑스럽네요 ㅎㅎㅎㅎ", "2023-02-25T13:52:17Z"], ["Sooooo cute", "2023-02-25T12:10:00Z"], ["Definitely the cutest kitchen assistants you could ask for!", "2023-02-25T11:30:04Z"], ["Okay let me start by saying I wish these amazing people were my neighbors. Would love to meet these doggos and would totally encourage this bonding activity to be a sweet for doggos business. So much love with this family. Such cute doggos, Rhya got better because of you guys and she belongs with you. Keep baking with all that love. I would 100% support your business and that beautiful loving bond.", "2023-02-25T06:16:08Z"], ["Doggoes eating better than me!🤣", "2023-02-25T03:17:00Z"], ["Food is your love language and I love how you've adapted recipes to make beautiful, safe and delicious treats to celebrate with your furbabies <3", "2023-02-25T01:18:31Z"], ["Rhya's little toe taps of excitement are adorable 🐾🐾💛💛", "2023-02-24T23:18:13Z"]], "4znhKBm5oOA": [["66", "2023-02-26T21:36:54Z"], ["What I kind and loving family to be given that loving sweet dog. They were meant to be !", "2023-02-26T20:39:57Z"], ["At the beginning of this video the place where Tony was kept with his bad leg, did they just leave him in pain suffering, until what?? The poor boy! Luckily these angels came along and helped Tony! He's a beautiful, gentle little soul! What a treasure he is!! 🐕 💕", "2023-02-26T20:35:37Z"], ["Love it! ❤️ Yay Tony & your new forever family", "2023-02-26T18:05:10Z"], ["Tony looks like an awesome pup and these are awesome people for taking him in! If only every animal that needed a good home could find one.", "2023-02-26T17:22:49Z"], ["Tony is gorgeous. Awesome rescuers also!", "2023-02-26T14:35:02Z"], ["i knew it the second she said she wanted to foster him. she was going to fail. but the way i see it is if your going to fail at something it should be fostering. Great video", "2023-02-26T07:02:12Z"], ["He is so gorgeous, nice handsome dog. Thank you & God Bless you for Rescues and giving him a Forever, Healthy Home and Plenty of Loves and Prayers", "2023-02-26T03:26:46Z"], ["Things couldn’t have gone better for this baby!! Thank you for failing in fostering him!! He belongs with you guys!!", "2023-02-25T20:33:52Z"], ["Bless ❤️", "2023-02-25T19:43:00Z"], ["Carrying that stick with the cone on was impressive. That took some determination to do puppy dog stuff. Such a cutie.", "2023-02-25T19:38:30Z"], ["Best boy. Beautiful butt curtain. A heckin good fluffer", "2023-02-25T16:56:09Z"], ["Wonderful!! Congratulations Tony and mom!! ♡", "2023-02-25T14:11:29Z"], ["I love these foster fails!", "2023-02-25T08:24:53Z"], ["Thank-You !!!!", "2023-02-25T02:47:21Z"], ["I knew this was in Raleigh, NC my home city. Congrats Tony! 🐾🐶", "2023-02-25T01:10:21Z"], ["I love hiw she says he had to come to her rescue, I understand that. She's awesome yayeee Tony!", "2023-02-25T01:05:08Z"], ["Good tony! Bless his heart\n❤", "2023-02-24T23:15:22Z"], ["instant connection hahahha he belonged with them all along. <3", "2023-02-24T22:51:30Z"], ["foster fail. hahahahahhahhaha", "2023-02-24T22:50:13Z"]]}