{"IrGZ66uKcl0": [["Hi, I’m Yousur Al-Hlou and I produced this visual investigation along with my colleagues Masha Froliak, Dmitriy Khavin, Christoph Koettl, Haley Willis, Alexander Cardia, Natalie Reneau and Malachy Browne. I’ll never forget the reporting trips Masha and I made to Bucha, Ukraine, in early April: we witnessed bodies, some with arms bound behind their backs, strewn along a single street in this town on the outskirts of Kyiv. We decided to investigate who killed them. Eight months later, we know. Using exclusive phone records, documents, interviews and thousands of hours of video, we proved how a single paratrooper military unit, the 234th Air Assault Regiment, killed dozens of Ukrainians on Yablunska Street.", "2022-12-22T16:40:18Z"], ["Absolutely outstanding journalism I hope your evidence brings these monsters to justice", "2023-02-19T18:35:46Z"], ["Bring back the SS", "2023-02-19T17:27:20Z"], ["Puff alimanias", "2023-02-19T15:44:03Z"], ["the whole world and especially the russian people need to see this report.  terrible.", "2023-02-19T15:37:10Z"], ["Worse things than this happens in Africa yet no one talks", "2023-02-19T15:29:21Z"], ["What's happening in Ukraine is no different than what happened in Afghanistan, Syria, Iraq and Libya. How come no one stood up for that? What legitimizes Americans and Nato's actions in these countries? Why everyone is calling Russian Army regiment criminals?  One nation's hero, other nation's villain.", "2023-02-19T15:28:06Z"], ["Excellent video !  Thank you !", "2023-02-19T14:34:43Z"], ["🇷🇺⚠Fashizm", "2023-02-19T14:18:41Z"], ["Thank you for your work!", "2023-02-19T14:06:26Z"], ["i hope that everyone gets their just punishment ...", "2023-02-19T13:54:22Z"], ["Народ Украины никогда не забудет и не простит смерти своих граждан. Пусть россияне не сомневаются, расплата настигнет каждого оккупанта.🇺🇦✊", "2023-02-19T13:47:06Z"], ["Ukraine's joker is actually responsible for this, he let untrained civilians to fight against an army....what could you expect..they killed young men not women and old people just to mske sure safety", "2023-02-19T11:17:41Z"], ["Good work New York Times 👏", "2023-02-19T10:33:14Z"], ["And again Russia still dodges this killing spree act unscathed. Ridiculous, with the evidences and yet these world leaders are still bobbling about which side is going to who's side.", "2023-02-19T10:20:30Z"], ["What Do Amerika? ABU -GUHRAIB   & more !!   🤡🇺🇸", "2023-02-19T10:02:11Z"], ["Civielien have Not nazi Flaggs in hes Haus!! And civiliens  Not have weapons !! The civiliens shot peaple years and than cam russia!! You first Look what america All do !!!", "2023-02-19T09:58:25Z"], ["Show what ukrain Do all the years !!", "2023-02-19T09:53:52Z"]], "RrH40nCcjwE": [["Wrong incomplete bias info", "2023-02-12T15:11:25Z"], ["Love America or hate America，But no one can ignore America.", "2023-01-10T01:17:56Z"], ["James Mattis quitting the warrrior monk leaving his job should tell how much trump messed up.", "2022-11-25T03:51:04Z"], ["USA AND THEIR GANG STEALING 66,000 BARRELS OF CRUDE OIL DAILY FROM SYRIA SOIL.  THIS AMOUNT IS APPROXIMATELY 80% OF TOTAL PRODUCTION OF CRUDE OIL IN SYRIA. USA INTERVENTION HAS COST SYRIAN ENERGY INDUSTRY 105 BILLION IN DIRECT AND  INDIRECT LOSSES. USA VOICING OUT ABOUT HUMANITIES AND SOCIAL JUSTICE.  IT IS ONLY EMPTY SLOGAN USA IS IN FACT THE MAIN AGGRESSOR, IMPERIAL, KILLER AND BURGLAR CHAMPION OF THE UNIVERSE.  THEY SHOULD STOP THE INJUSTICE ECONOMIC SANCTION TO SYRIAN PEOPLE AND COMPENSATE BILLIONS OF DOLLARS FOR THE DAMAGES, SUFFERNESS, AND ALL NATURAL RESOURCES THEY STOLE FROM SYRIA FOR ALMOST A DECADE.  USA IS THE MAIN SPONSOR OF TERRORISM AND MAIN KILLER.  USA IS THE GREAT DEVIL.   b", "2022-09-29T15:44:31Z"], ["Niyə amerikalılar susur. Onlara aid olmayan Syria , Phalastine, İrak, Yemen kimi müsəlmanlar yaşayan torpaqlarda müharibə edir və özləri də ölürlər. Amerikalılar buna görə günahsız insanları öldürür və ölür. Əskər olsanda gərək şərəfsiz olmayasan. Bütün Amerika vətəndlarına ölüm olsun.çünki  onlar buna susurlar. Onlar terrorçudurlar.", "2022-09-26T08:58:31Z"], ["SYRIA STRUGGLE TO FIGHT TERRORISM  SPONSORED AND SUPPORTED BY THE WESTERN COUNTRIES.  THE WESTERN COUNTRIES ESPECIALLY USA ARE VOICING OUT ABOUT FREEDOM AND PEACE BUT THE REALITY IT IS ONLY SLOGAN. THEY ARE THE MAIN TERRORIST AND MAIN SUPPORTERS OF MANY TERRORIST GROUPS ALL OVER THE WORLD INCLUDING SYRIA.  THE SYRIAN PEOPLE SUFFERE IN THEIR DAILY LIFE.  THEIR HOUSES AND CITIES DESTROYED BECAUSE OF WAR CREATED AND INITIATED BY THE WESTERN COUNTRIES.  SYRIA SHOULD BE HELPED AND SUPPORTED BY WORLD COMMUNITIES BECAUSE THEY FIGHT AGAINST TERRORISM FOR THE ENTIRE WORLD\n\nr", "2022-09-11T04:49:59Z"], ["This is not all true information \nWhatreally happen in Syria", "2022-08-28T13:55:06Z"], ["GO HOME YANKEE", "2022-08-17T21:29:49Z"], ["\"occupation of Syria\"", "2022-06-27T06:30:10Z"], ["A king in Syria, one fortress, took all your countries", "2022-06-26T18:42:25Z"], ["https://youtu.be/bERS8p4qu2A", "2022-06-15T12:23:57Z"], ["https://youtu.be/h4CbsSR2VvA", "2022-06-15T12:22:26Z"], ["USA funded ISIS. They wanted regime change in Syria cause Asad wasn't cooperating with them for usa interests. Chemical attacks proved propaganda from your corporate media.", "2022-06-15T12:21:32Z"], ["Can anyone of us imagine the quality of life the Americas would have if the USA tended to its own affairs and leave the other regions of the world o tend to theirs. Personally I’d just settle for a US high speed rail service.", "2022-04-03T18:18:00Z"], ["Of course Obama did nothing wrong and it was all Trumps fault", "2022-03-24T09:14:57Z"], ["😂 more like won the oil fields", "2022-03-16T23:53:37Z"], ["the propaganda in this video is huge.", "2022-03-13T16:56:54Z"], ["Is it still possible for America to come back in Non intervention just like before WW1 and WW2", "2022-03-06T12:26:28Z"], ["Base on this principle set by us Russian invasion of Ukraine is justified.", "2022-03-06T07:21:26Z"], ["I think wars as we know it changed fundamentally. It hasn’t gone away, only becoming a lot more covert.. The new form of warfare is toppling governments, outsourcing battles to territorists, funding revolts, cyber attacks, and media / information warfare.", "2022-03-06T04:04:07Z"]], "V4-ycdxqimA": [["Hi — I’m Haley, one of the producers on this video! Here to give some insight into how we put this piece together. It’s a visual explainer that uses visuals of a top Iranian general to analyze a complicated topic — how Iran’s covert Quds Force operates. \n\n\nAfter Qassim Suleimani was killed in a U.S. airstrike, we combed through hundreds of images and videos of him. We wanted to know more about his unit, the Quds Force. Sightings of Quds Force members are extremely rare, but Suleimani had quite the public persona. So we compiled a spreadsheet of videos and images of Suleimani, going back to the 1980s when he served in the Iran-Iraq War. \n\n\nWe noticed that the “shadow commander” really started popping up around 2014, right after ISIS took Mosul. Experts told us that this was on purpose — part of how the Quds Force carefully shaped its narrative around Suleimani. \n\n\nWe treated the visuals as evidence, packed with information — we geolocated them to find out where Suleimani was and identified who he was with (whether it be a senior Hezbollah commander or a fighter from the Iraqi militia Harakat Hezbollah al-Nujaba). Weapons and insignia in the visuals act as further clues of Iranian influence. And all of these sightings put together are a unique lens into how the Quds Force operates — through a network of partner and proxy forces along a corridor that stretches from Iran all the way to Lebanon.", "2020-02-03T20:40:57Z"], ["Haha.  One of those guys that when you hear his voice, the whole “look” falls apart.", "2023-02-12T01:10:07Z"], ["Best man😞😞😞🇮🇷🇮🇷🇮🇷🇮🇷Qassim suleimani🖤🖤❤️🖤💪💪💪……soon", "2023-02-10T19:35:57Z"], ["Vladimir Putin's plans with Ukraine💙💛-Russia and its frustrated dream of winning in its Capitalism *VS* Socialism competition to revive the forgotten lost ideology of the USSR of *the cold war*", "2023-02-05T21:26:27Z"], ["#جان_فدا\n#ایران_قوی\n#قاسم_سلیمانی\n#مرگ_بر_آمریکا", "2023-01-29T07:17:29Z"], ["Your nightmare. He defeated your Daesh, hungry american cowboys #WarCriminals.", "2023-01-25T17:07:48Z"], ["American bases in iraq how built America bases in America not in Iraq u american terrorists", "2023-01-13T20:53:54Z"], ["🇺🇸 is a biggest problem for the world 🌎", "2023-01-05T04:44:27Z"], ["you wanna talk about propaganda? he was fighting against isis and you tell the narrative by saying oh it was brutal and civilians were collateral? \nyou know how much collateral damage USA has done during its countless wars? ISIS was created through USA mistakes and iran fighting your mistake on its doorsteps is considered unethical? wow", "2022-12-01T00:06:41Z"], ["i can see how these must look from the perspective of western people, but you should know that isis (who was basically created by usa miscalculated supports) was on our doorsteps, other rebel groups in iraq and syria who were daily sending public messages about their plans to destroy iran, UAE openly and proudly talking daliy about arming militia forces against us, Taliban raising more and more to power on the other side, and so many more enemies all arround us\nwe were basically surrounded by sworn enemies, and this man basically became their nightmare, no one contributed to isis defeat more than him (according to iraq military itself)\nnever forget one nation villain, is anothers hero, and he was one of our greatest heroes", "2022-12-01T00:01:16Z"], ["More areas of the world affected by conflicts initiated via made up religions… very childish", "2022-11-11T23:01:58Z"], ["Thx America for bombing this mf \ngreetings from🇱🇧", "2022-10-20T09:52:34Z"], ["شهید حاج قاسم، از پاکترین و با اخلاص ترین مردان خدا بود\nراهت تا ابد ادامه داره🇮🇷🇮🇷🇮🇷\nسلام برحاج قاسم و ابومهدی", "2022-10-20T03:56:12Z"], ["Don't you ever mess with American power", "2022-10-01T22:48:41Z"], ["When everyone left Palestinians, Iranians supported them.", "2022-08-14T05:43:11Z"], ["Victim may be right or wrong.., but the thought of another country carrying out covert operation which killed the country's top general is simply outrageous. How about if US general is killed the same way?? I mean, which country's general is completely clean of military actions??", "2022-08-03T22:56:30Z"], ["Boom, Gone, Good!!!", "2022-07-15T21:08:36Z"], ["everything is propaganda. lol", "2022-07-12T11:08:30Z"], [".                                                  .                                    .                    گوز به روحت", "2022-06-17T18:45:52Z"], ["Qasim suleimani zindabad..❤️🇵🇰❤️🇵🇰", "2022-05-24T09:47:06Z"]], "R6-6wV0agvs": [["Followers of our Visual Investigations here on YouTube might be interested in the reporting process behind this story. In the days after this shooting, the Nigerian military posted a video of Donald Trump implied that American troops at the Mexico border should use gunfire to respond to migrants who protest by throwing rocks. That drew international attention to what happened in Abuja. We worked with researchers at Storyful to see what footage was posted to social media from Abuja. We quickly discovered shocking scenes. It was clear the military overreacted and fired at people as they retreated, but the scenes were chaotic and it was difficult to understand what exactly happened. We contacted sources in Abuja who sent us more footage. We were able to verify a large number of casualties from the shooting, far more than the Nigerian military admitted. So we dispatched our freelance reporter Emmanuel Akinwotu to Abuja over several days. He met survivors in hospitals, talked to witnesses and collected a trove of video evidence from their cellphones. Much of it had not been seen before. In New York, we reconstructed what happened step-by-step, putting order to the chaos. We geo-located the site where the shooting happened - a military checkpoint outside Abuja. My colleague Christoph Koettl, a geo-spatial analyst, examined old satellite footage to see where the roadblock is usually set up -- on a side road which is parallel to the highway. Emmanuel went to the scene and confirmed through local sources that traffic usually flows freely through here, as it was on the day of the march (the military said the marchers blocked traffic, but in fact the military did, when they slid their roadblock across the highway). Christoph researched the military from logos and insignia in the footage, he identified the battalion involved in the shooting - the Guards Brigade, an elite unit that has a short chain of command to President Buhari. He also identified some of the weapons they used, including a heavy .50 caliber machine gun we could see and hear in the footage. It blew limbs off some people. We talked to former U.S. Marines on staff, including our weapons expert John Ismay, about this and other machine guns we saw in the footage. Dionne Searcey, our West Africa Bureau Chief reported out other aspects of the declining security situation in Nigeria, and the history of impunity among the Nigerian military that allows events like this to go unpunished. Christoph also retrieved old satellite imagery of a mass grave from a 2015 incident - he had reported on that incident for Amnesty International, where he worked at the time. Emmanuel interviewed military spokesman John Agim about our findings. He insisted that the checkpoint was attacked, the marchers intended to occupy Abuja and they had to be stopped. But what the Nigerian military did in this instance - to police unarmed protesters with live gunfire when there was no risk to life - is illegal under international law. You can read Christoph's visual Twitter thread here: https://twitter.com/ckoettl/status/1074702786615496706", "2018-12-18T14:18:28Z"], ["since when do muslims recognize anything past the koran?", "2023-02-15T04:39:39Z"], ["Future Jihad 💩", "2023-01-30T19:26:00Z"], ["🤦🤦", "2023-01-25T12:31:50Z"], ["good camera works....nigerian soldiers feel \"rambo\" on civilians yet boko haram is really troubling them", "2023-01-10T19:53:05Z"], ["My ancestors were sold by Africans to Europeans and arabs during the slave trade. Its easy to be mad at non blk people but when a person takes the time to look at see the state of africa especially Nigeria where a huge percentage of Africans were sold from it all makes sense. Something is inherently wrong with the people in that region... something is seriously wrong with those people. I'm kinda glad I'm not there smh.", "2023-01-08T00:08:53Z"], ["Black lives do NOT matter on that continent at all.", "2023-01-08T00:00:23Z"], ["What rong with nageria army this is not the first time they do things like this", "2023-01-06T09:56:38Z"], ["No such thing as an elite Nigerian solder. Animals is the word .", "2023-01-01T12:04:03Z"], ["50caibilar bullet 😟", "2022-12-15T10:51:29Z"], ["This is what government security forces are for, well done 👍", "2022-12-10T15:37:55Z"], ["THIS SHOULD BE CALLED HOW TO CREATE SUICIDE BOMBERS..", "2022-12-08T14:18:58Z"], ["Wicked Evil demons.", "2022-11-12T11:50:50Z"], ["THERE WILL NEVER BE PEACE UNTIL RELIGEIONIST  FACTIONS ARE STRIPPED OF ALL POWER EXCEPT PREACHING TO HOT AIR. TIME WILL PROVE IT AS USUAL, NOTHING CHANGES.", "2022-11-04T17:51:56Z"], ["Ahhh a Muslim movement being covered by Western Media to please their middle eastern friends. Cute.", "2022-10-28T04:19:03Z"], ["Nowonder they are still poor", "2022-10-16T16:28:17Z"], ["This was a Sad, Needless Incident. I remain unhappy by the losses of lives and abilities. However, this was a continuum from the 2015 Incident, in which our Military claimed that the life of  the erstwhile Chief of Army Staff(COAS), then Lt. Gen. Tukur Buratai, was threatened by the irate crowd of this sect. I can recall Buratai's flat, expressionless, negative response to a journalist on whether he was sorry for the actions of his men on that day. It seems as if our Army continue to retain sour grapes from the first fracas. But, that's, my opinion.", "2022-10-11T15:21:29Z"], ["Such a shame on you nigerian government  for not responding to these human right violation....", "2022-10-08T11:35:46Z"], ["Respect their culture.", "2022-10-04T04:07:45Z"], ["These people are trouble", "2022-10-03T07:05:35Z"]]}